walmis/xpcc/src/xpcc/architecture/platform/cortex_m3/lpc/lpc17/dma/DMA.h
/*
    Copyright (c) 2010 Andy Kirkham
 
    Permission is hereby granted, free of charge, to any person obtaining a copy
    of this software and associated documentation files (the "Software"), to deal
    in the Software without restriction, including without limitation the rights
    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
    copies of the Software, and to permit persons to whom the Software is
    furnished to do so, subject to the following conditions:
 
    The above copyright notice and this permission notice shall be included in
    all copies or substantial portions of the Software.
 
    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
    THE SOFTWARE.
    
    @file          MODDMA.h 
    @purpose       Adds DMA controller and multiple transfer configurations
    @version       see ChangeLog.c
    @date          Nov 2010
    @author        Andy Kirkham    
*/

#ifndef MODDMA_H
#define MODDMA_H

/** @ingroup lpc17 */
/** @defgroup API DMA */

#include <lpc17xx/cmsis/LPC17xx.h>
#include <xpcc/processing.hpp>

//#include "iomacros.h"

extern "C" void DMA_IRQHandler();

namespace xpcc {
namespace lpc17 {

//forward reference
class DMAConfig;
class DMA;

//! Channel definitions.
enum DMAChannel {
      Channel_0 = 0     /*!< Channel 0 */
    , Channel_1         /*!< Channel 1 */
    , Channel_2         /*!< Channel 2 */
    , Channel_3         /*!< Channel 3 */
    , Channel_4         /*!< Channel 4 */
    , Channel_5         /*!< Channel 5 */
    , Channel_6         /*!< Channel 6 */
    , Channel_7         /*!< Channel 7 */
};

//! DMA Connection number definitions
enum DMAConnection {
      SSP0_Tx       = 0UL   /*!< SSP0 Tx */
    , SSP0_Rx       = 1UL   /*!< SSP0 Rx */
    , SSP1_Tx       = 2UL   /*!< SSP1 Tx */
    , SSP1_Rx       = 3UL   /*!< SSP1 Rx */
    , ADC           = 4UL   /*!< ADC */
    , I2S_Channel_0 = 5UL   /*!< I2S channel 0 */
    , I2S_Channel_1 = 6UL   /*!< I2S channel 1 */
    , DAC           = 7UL   /*!< DAC */
    , UART0_Tx      = 8UL   /*!< UART0 Tx */
    , UART0_Rx      = 9UL   /*!< UART0 Rx */
    , UART1_Tx      = 10UL  /*!< UART1 Tx */
    , UART1_Rx      = 11UL  /*!< UART1 Rx */
    , UART2_Tx      = 12UL  /*!< UART2 Tx */
    , UART2_Rx      = 13UL  /*!< UART2 Rx */
    , UART3_Tx      = 14UL  /*!< UART3 Tx */
    , UART3_Rx      = 15UL  /*!< UART3 Rx */
    , MAT0_0        = 16UL  /*!< MAT0.0 */
    , MAT0_1        = 17UL  /*!< MAT0.1 */
    , MAT1_0        = 18UL  /*!< MAT1.0 */
    , MAT1_1        = 19UL  /*!< MAT1.1 */
    , MAT2_0        = 20UL  /**< MAT2.0 */
    , MAT2_1        = 21UL  /*!< MAT2.1 */
    , MAT3_0        = 22UL  /*!< MAT3.0 */
    , MAT3_1        = 23UL  /*!< MAT3.1 */
};

//! GPDMA Transfer type definitions
enum  DMATransferType {
      m2m = 0     /*!< Memory to memory - DMA control */
    , m2p = 1     /*!< Memory to peripheral - DMA control */
    , p2m = 2     /*!< Peripheral to memory - DMA control */
    , p2p = 3     /*!< Src peripheral to dest peripheral - DMA control */
    , g2m = 4     /*!< Psuedo special case for reading "peripheral GPIO" that's memory mapped. */
    , m2g = 5     /*!< Psuedo Special case for writing "peripheral GPIO" that's memory mapped. */
};

//! Burst size in Source and Destination definitions */
enum DMABurstSize {
      _1    = 0   /*!< Burst size = 1 */
    , _4    = 1   /*!< Burst size = 4 */
    , _8    = 2   /*!< Burst size = 8 */
    , _16   = 3   /*!< Burst size = 16 */
    , _32   = 4   /*!< Burst size = 32 */
    , _64   = 5   /*!< Burst size = 64 */
    , _128  = 6   /*!< Burst size = 128 */
    , _256  = 7   /*!< Burst size = 256 */
};

//! Width in Src transfer width and Dest transfer width definitions */
enum DMATransferWidth {
      byte     = 0    /*!< Width = 1 byte */
    , halfword = 1    /*!< Width = 2 bytes */
    , word     = 2    /*!< Width = 4 bytes */
};


/**
 * @brief The MODDMA configuration system (linked list items)
 * @author Andy Kirkham
 * @see http://mbed.org/cookbook/MODDMA_Config
 * @see MODDMA
 * @see MODDMA_Config
 * @ingroup API
 */
class DMALLI {
public:
	DMALLI() {
		SrcAddr = 0;
		DstAddr = 0;
		NextLLI = 0;
		Control = 0;
	}
	DMALLI(DMAConfig* cfg);

	/// Set transfer size for LLI transfer
	DMALLI* transferSize(uint16_t n);

    class DMALLI *srcAddr(uint32_t n) { SrcAddr = n; return this; }
    class DMALLI *dstAddr(uint32_t n) { DstAddr = n; return this; }
    class DMALLI *nextLLI(uint32_t n) { NextLLI = n; return this; }
    class DMALLI *control(uint32_t n) { Control = n; return this; }
    uint32_t srcAddr(void) { return SrcAddr; }
    uint32_t dstAddr(void) { return DstAddr; }
    uint32_t nextLLI(void) { return NextLLI; }
    uint32_t control(void) { return Control; }

    uint32_t SrcAddr;    //!< Source Address
    uint32_t DstAddr;    //!< Destination address
    uint32_t NextLLI;    //!< Next LLI address, otherwise set to '0'
    uint32_t Control;    //!< GPDMA Control of this LLI
};

/**
 * @brief The DMA configuration system
 * @author Andy Kirkham
 * @see http://mbed.org/cookbook/MODDMA_Config
 * @ingroup API
 *
 * <b>DMAConfig</b> defines a configuration that can be passed to the DMA controller
 * instance to perform a GPDMA data transfer.
 */
class  DMAConfig {
protected:

    // *****************************************
    // From GPDMA by NXP MCU SW Application Team
    // *****************************************
    
    uint8_t ChannelNum;        //!< DMA channel number, should be in range from 0 to 7.
    uint32_t TransferSize;      //!< Length/Size of transfer 

    uint8_t srcTransferWidth : 4;
    uint8_t dstTransferWidth : 4;

    uint8_t sbsize : 4;
    uint8_t dbsize : 4;

    uint32_t SrcMemAddr;        //!< Physical Src Addr, used in case TransferType is chosen as MODDMA::GPDMA_TRANSFERTYPE::m2m or MODDMA::GPDMA_TRANSFERTYPE::m2p
    uint32_t DstMemAddr;        //!< Physical Destination Address, used in case TransferType is chosen as MODDMA::GPDMA_TRANSFERTYPE::m2m or MODDMA::GPDMA_TRANSFERTYPE::p2m 
    uint8_t TransferType;      //!< Transfer Type
    uint8_t SrcConn;           //!< Peripheral Source Connection type, used in case TransferType is chosen as
    uint8_t DstConn;           //!< Peripheral Destination Connection type, used in case TransferType is chosen as
    uint32_t LLI;            //!< Linker List Item structure data address if there's no Linker List, set as '0'
    uint8_t DMACSync;          //!< DMACSync if required.
    uint8_t flags;

