walmis/xpcc/src/xpcc/architecture/platform/cortex_m3/lpc/lpc17/dma/DMA.h
public: 

    enum Flags {
		FORCE_SI_ON = 1<<0, ///< Force source address increment on
		FORCE_SI_OFF = 1<<1, ///< Force source address increment off
		FORCE_DI_ON = 1<<2, ///< Force destination address increment on
		FORCE_DI_OFF = 1<<3 ///< Force destination address increment off
	};

    DMAConfig() {
        ChannelNum    = 0xFF;
        TransferSize  = 0;
        srcTransferWidth = 0xF;
        dstTransferWidth = 0xF;
        sbsize = 0xF;
        dbsize = 0xF;
        SrcMemAddr    = 0;
        DstMemAddr    = 0;
        TransferType  = 0;
        SrcConn       = 0;
        DstConn       = 0;
        LLI           = 0;
        DMACSync      = 0;
        flags         = 0;
    }
        
    ALWAYS_INLINE DMAConfig * channelNum(DMAChannel n)    { ChannelNum = n & 0x7;  return this; }
    ALWAYS_INLINE DMAConfig * transferSize(uint32_t n)    { TransferSize = n;      return this; }
    ALWAYS_INLINE DMAConfig * transferWidth(DMATransferWidth n) {
    	dstTransferWidth = srcTransferWidth = (uint8_t)n;
    	return this;
    }
    ALWAYS_INLINE DMAConfig * srcWidth(DMATransferWidth n) { srcTransferWidth = (uint8_t)n;     return this; }
    ALWAYS_INLINE DMAConfig * dstWidth(DMATransferWidth n) { dstTransferWidth = (uint8_t)n;     return this; }
    ALWAYS_INLINE DMAConfig * srcMemAddr(uint32_t n)    { SrcMemAddr = n;        return this; }
    ALWAYS_INLINE DMAConfig * dstMemAddr(uint32_t n)    { DstMemAddr = n;        return this; }
    ALWAYS_INLINE DMAConfig * transferType(uint32_t n)  { TransferType = n;      return this; }
    ALWAYS_INLINE DMAConfig * srcConn(DMAConnection n)  { SrcConn = n;           return this; }
    ALWAYS_INLINE DMAConfig * dstConn(DMAConnection n)  { DstConn = n;           return this; }
    ALWAYS_INLINE DMAConfig * dmaLLI(uint32_t n)        { LLI = n;               return this; }
    ALWAYS_INLINE DMAConfig * dmacSync(uint32_t n)      { DMACSync = n;          return this; }
    ALWAYS_INLINE DMAConfig * transferFlags(Flags n)    { flags = (uint8_t)n;    return this; }
    /// Source burst size
    ALWAYS_INLINE DMAConfig * SBurstSize(DMABurstSize n)  { sbsize = (uint8_t)n; return this; }
    /// Destination burst size
    ALWAYS_INLINE DMAConfig * DBurstSize(DMABurstSize n)  { dbsize = (uint8_t)n; return this; }
    
    uint32_t channelNum(void)    { return ChannelNum;    }
    uint32_t transferSize(void)  { return TransferSize;  }
    uint32_t srcWidth(void)      { return srcTransferWidth; }
    uint32_t dstWidth(void)      { return dstTransferWidth; }
    uint32_t srcMemAddr(void)    { return SrcMemAddr;    }
    uint32_t dstMemAddr(void)    { return DstMemAddr;    }
    uint32_t transferType(void)  { return TransferType;  }
    uint32_t srcConn(void)       { return SrcConn;       }
    uint32_t dstConn(void)       { return DstConn;       }
    uint32_t dmaLLI(void)        { return LLI;        }
    uint32_t dmacSync(void)      { return DMACSync; }
    uint8_t transferFlags()      { return flags; }
    
    uint8_t SBurstSize()    { return sbsize; }
    uint8_t DBurstSize()    { return dbsize; }

    DMALLI* addLLI();

    void freeLLI();

    /**
     * Attach a callback to the TC IRQ configuration.
     *
     * @param fptr A function pointer to call
     * @return this
     */
    class DMAConfig * attach_tc(void (*fptr)(void)) {  
        isrIntTCStat.attach(fptr);
        return this;
    }
    
    /**
     * Attach a callback to the ERR IRQ configuration.
     *
     * @param fptr A function pointer to call
     * @return this
     */
    class DMAConfig * attach_err(void (*fptr)(void)) {  
        isrIntErrStat.attach(fptr);
        return this;
    }
    
    /**
     * Attach a callback to the TC IRQ configuration.
     *
     * @param tptr A template pointer to the calling object
     * @param mptr A method pointer within the object to call.
     * @return this
     */
    template<typename T>
    class DMAConfig * attach_tc(T* tptr, void (T::*mptr)(void)) {  
        if((mptr != NULL) && (tptr != NULL)) {
            isrIntTCStat.attach(tptr, mptr);
        }
        return this;
    }
    
    /**
     * Attach a callback to the ERR IRQ configuration.
     *
     * @param tptr A template pointer to the calling object
     * @param mptr A method pointer within the object to call.
     * @return this
     */
    template<typename T>
    class DMAConfig * attach_err(T* tptr, void (T::*mptr)(void)) {  
        if((mptr != NULL) && (tptr != NULL)) {
            isrIntErrStat.attach(tptr, mptr);
        }
        return this;
    }

    FunctionPointer isrIntTCStat;
    FunctionPointer isrIntErrStat;
};


 /**
 * @brief MODDMA GPDMA Controller
 * @author Andy Kirkham
 * @see http://mbed.org/cookbook/MODDMA
 * @see example1.cpp
 * @ingroup API
 *
 * <b>MODDMA</b> defines a GPDMA controller and multiple DMA configurations that allow for DMA
 * transfers from memory to memory, memory to peripheral or peripheral to memory.
 *
 * At the heart of the library is the MODDMA class that defines a single instance controller that
 * manages all the GPDMA hardware registers and interrupts. The controller can accept multiple
 * configurations that define the channel transfers. Each configuration specifies the source and 
 * destination information and other associated parts to maintain the transfer process.
 *
 * Standard example:
 * @code
 * #include "mbed.h"
 * #include "MODDMA.h"
 *
 * DigitalOut led1(LED1);
 * Serial pc(USBTX, USBRX); // tx, rx
 * MODDMA dma;
 *
 * int main() {
 *
 *     // Create a string buffer to send directly to a Uart/Serial
 *     char s[] = "***DMA*** ABCDEFGHIJKLMNOPQRSTUVWXYZ ***DMA***";
 *
 *     // Create a transfer configuarion
 *     MODDMA_Config *config = new MODDMA_Config;
 *
 *     // Provide a "minimal" setup for demo purposes.
 *     config
 *      ->channelNum    ( MODDMA::Channel_0 )   // The DMA channel to use.
 *      ->srcMemAddr    ( (uint32_t) &s )       // A pointer to the buffer to send.
 *      ->transferSize  ( sizeof(s) )           // The size of that buffer.
 *      ->transferType  ( MODDMA::m2p )         // Source is memory, destination is peripheral
 *      ->dstConn       ( MODDMA::UART0_Tx )    // Specifically, peripheral is Uart0 TX (USBTX, USBRX)
 *    ; // config end.
 *
 *    // Pass the configuration to the MODDMA controller.
 *    dma.Setup( config );
 *
 *    // Enable the channel and begin transfer.
 *    dma.Enable( config->channelNum() );
 *
 *    while(1) {
 *         led1 = !led1;
 *         wait(0.25);
 *     }
 * }
 * @endcode
 */
class DMA
{
public:
    
    //! Interrupt callback types.
    enum IrqType_t {
          TcIrq = 0     /*!< Terminal Count interrupt */
        , ErrIrq        /*!< Error interrupt */
    };
    
    //! Return status codes.
    enum Status {
          Ok            = 0     /*!< Ok, suceeded */
        , Error         = -1    /*!< General error */
        , ErrChInUse    = -2    /*!< Specific error, channel in use */
    };
    

    
    //! DMA Request Select Mode definitions. */
    enum GPDMA_REQSEL {
          uart  = 0UL   /*!< UART TX/RX is selected */
        , timer = 1UL   /*!< Timer match is selected */
    };

    //! GPDMA Control register bits.
    enum Config {
          _E = 1        /*!< DMA Controller enable */
        , _M = 2        /*!< AHB Master endianness configuration */
    };    

    //! GPDMA Channel config register bits.
    enum CConfig {
          _CE  = (1UL << 0)     /*!< Channel enable */
        , _IE  = (1UL << 14)    /*!< Interrupt error mask */
        , _ITC = (1UL << 15)    /*!< Terminal count interrupt mask */
        , _LOCK   = (1UL << 16)    /*!< Lock */
        , _A   = (1UL << 17)    /*!< Active */
        , _H   = (1UL << 18)    /*!< Halt */
    };
    

    static DMA* instance() {
    	if(!moddma_p) {
    		moddma_p = new DMA;
    	}
    	return moddma_p;
    }
    

    /**
     * Used to setup and enable the DMA controller.
     *
     * @see Setup
     * @see Enable
     * @param c A pointer to an instance of MODDMA_Config to setup.
     */
    uint32_t Prepare(DMAConfig *c) {
        uint32_t u = Setup(c);
        if (u) Enable(c);
        return u;
    }
    
    /**
     * Used to setup the DMA controller to prepare for a data transfer.
     *
     * @param c A pointer to an instance of MODDMA_Config to setup.
     */
    uint32_t Setup(DMAConfig *c);
    
    /**
     * Enable and begin data transfer.
     *
     * @param ChannelNumber Type DMAChannel, the channel number to enable
     */
    void Enable(DMAChannel ChannelNumber);
    
    /**
     * Enable and begin data transfer (overloaded function)
     *
     * @param ChannelNumber Type uin32_t, the channel number to enable
     */
    void Enable(uint32_t ChannelNumber) { Enable((DMAChannel)(ChannelNumber & 0x7)); }
    
    /**
     * Enable and begin data transfer (overloaded function)
     *
     * @param config A pointer to teh configuration
     */
    void Enable(DMAConfig *config) { Enable( config->channelNum() ); }
        
    
    /**
     * Disable a channel and end data transfer.
     *
     * @ingroup API
     * @param ChannelNumber Type DMAChannel, the channel number to enable
     */
    void Disable(DMAChannel ChannelNumber);
    
    /**
     * Disable a channel and end data transfer (overloaded function)
     *
     * @ingroup API
     * @param ChannelNumber Type uin32_t, the channel number to disable
     */
    void Disable(uint32_t ChannelNumber) { Disable((DMAChannel)(ChannelNumber & 0x7)); }
    
    /**
     * Is the specified channel enabled?
     *
     * @param ChannelNumber Type DMAChannel, the channel number to test
     * @return bool true if enabled, false otherwise.
     */
    bool Enabled(DMAChannel ChannelNumber);
    
    /**
     * Returns LPC_DMA->DMACControl value for a specific channel configuration
     *
     * @param Pointer to channel configuration
     * @return DMACControl value
     */
    static uint32_t buildControlValue(DMAConfig* cfg);

    static void getSrcDestAddresses(DMAConfig* cfg, uint32_t& srcAddr, uint32_t& destAddr);

    /**
     * Is the specified channel enabled? (overloaded function)
     *
      * @param ChannelNumber Type uin32_t, the channel number to test
     * @return bool true if enabled, false otherwise.
     */
    bool Enabled(uint32_t ChannelNumber) { return Enabled((DMAChannel)(ChannelNumber & 0x7)); }
    
    static __INLINE uint32_t IntStat(uint32_t n)            { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t IntTCStat_Ch(uint32_t n)       { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t IntTCClear_Ch(uint32_t n)      { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t IntErrStat_Ch(uint32_t n)      { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t IntErrClr_Ch(uint32_t n)       { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t RawIntErrStat_Ch(uint32_t n)   { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t EnbldChns_Ch(uint32_t n)       { return (1UL << n) & 0xFF; }
    static __INLINE uint32_t SoftBReq_Src(uint32_t n)       { return (1UL << n) & 0xFFFF; }
    static __INLINE uint32_t SoftSReq_Src(uint32_t n)       { return (1UL << n) & 0xFFFF; }
    static __INLINE uint32_t SoftLBReq_Src(uint32_t n)      { return (1UL << n) & 0xFFFF; }
    static __INLINE uint32_t SoftLSReq_Src(uint32_t n)      { return (1UL << n) & 0xFFFF; }
    static __INLINE uint32_t Sync_Src(uint32_t n)           { return (1UL << n) & 0xFFFF; }
    static __INLINE uint32_t ReqSel_Input(uint32_t n)       { return (1UL << (n - 8)) & 0xFF; }
    

    static __INLINE uint32_t CxControl_TransferSize(uint32_t n)     { return (n & 0xFFF) << 0; }
    static __INLINE uint32_t CxControl_SBSize(uint32_t n)           { return (n & 0x7) << 12; }
    static __INLINE uint32_t CxControl_DBSize(uint32_t n)           { return (n & 0x7) << 15; }
    static __INLINE uint32_t CxControl_SWidth(uint32_t n)           { return (n & 0x7) << 18; }
    static __INLINE uint32_t CxControl_DWidth(uint32_t n)           { return (n & 0x7) << 21; }
    static __INLINE uint32_t CxControl_SI()                         { return (1UL << 26); }
    static __INLINE uint32_t CxControl_DI()                         { return (1UL << 27); }
    static __INLINE uint32_t CxControl_Prot1()                      { return (1UL << 28); }
    static __INLINE uint32_t CxControl_Prot2()                      { return (1UL << 29); }
    static __INLINE uint32_t CxControl_Prot3()                      { return (1UL << 30); }
    static __INLINE uint32_t CxControl_I()                          { return (1UL << 31); }
    static __INLINE uint32_t CxControl_E()                          { return (1UL << 0); }
    static __INLINE uint32_t CxConfig_SrcPeripheral(uint32_t n)     { return (n & 0x1F) << 1; }
    static __INLINE uint32_t CxConfig_DestPeripheral(uint32_t n)    { return (n & 0x1F) << 6; }
    static __INLINE uint32_t CxConfig_TransferType(uint32_t n)      { return (n & 0x7) << 11; }
    static __INLINE uint32_t CxConfig_IE()                          { return (1UL << 14); }
    static __INLINE uint32_t CxConfig_ITC()                         { return (1UL << 15); }
    static __INLINE uint32_t CxConfig_L()                           { return (1UL << 16); }
    static __INLINE uint32_t CxConfig_A()                           { return (1UL << 17); }
    static __INLINE uint32_t CxConfig_H()                           { return (1UL << 18); }
    
    /**
     * A store for up to 8 (8 DMAChannel) of configurations.
     * @see MODDMA_Config
     */
    DMAConfig *setups[8];
    
    /**
     * Get a pointer to the current configuration the ISR is servicing.
     *
     * @return MODDMA_Config * A pointer to the setup the ISR is currently servicing.
     */
    DMAConfig *getConfig(void) { return setups[IrqProcessingChannel]; }
    
    
    /**
     * Gets which channel the ISR is currently servicing.
     *
     * @return DMAChannel The current channel the ISR is servicing.
     */
    DMAChannel irqProcessingChannel(void) { return IrqProcessingChannel; }
    
    /**
     * Sets which type of IRQ the ISR is making a callback for.
     *
     * *** USED INTERNALLY. DO NOT CALL FROM USER PROGRAMS ***
     *
     * Must be public so the extern "C" ISR can use it.
     */ 
    void setIrqType(IrqType_t n) { IrqType = n; }
    
    /**
     * Get which type of IRQ the ISR is calling you about,
     * terminal count or error.
     */
    IrqType_t irqType(void) { return IrqType; }
    
    /**
     * Clear the interrupt after handling.
     *
     * @param DMAChannel The channel the IQR occured on.
     */
    void clearTcIrq(DMAChannel n) { LPC_GPDMA->DMACIntTCClear = (uint32_t)(1UL << n); }
    
    /**
     * Clear the interrupt the ISR is currently handing..
     */
    void clearTcIrq(void) { clearTcIrq( IrqProcessingChannel ); }
    
    /**
     * Clear the error interrupt after handling.
     *
     * @ingroup API
     * @param DMAChannel The channel the IQR occured on.
     */
    void clearErrIrq(DMAChannel n) { LPC_GPDMA->DMACIntTCClear = (uint32_t)(1UL << n); }
    
    /**
     * Clear the error interrupt the ISR is currently handing.
     * @ingroup API
     */
    void clearErrIrq(void) { clearErrIrq( IrqProcessingChannel ); }
   
    /**
     * Is the supplied channel currently active?
     *
     * @ingroup API
     * @param DMAChannel The channel to inquire about.
     * @return bool true if active, false otherwise.
     */     
    bool isActive(DMAChannel ChannelNumber) {
        LPC_GPDMACH_TypeDef *pChannel = (LPC_GPDMACH_TypeDef *)Channel_p( ChannelNumber );
        return (bool)( pChannel->DMACCConfig & CxConfig_A() ) ;
    }

    bool isActive(DMAConfig* config) {
    	return isActive((DMAChannel)config->channelNum());
    }
    
    /**
     * Halt the supplied channel. 
     *
     * @ingroup API
     * @param DMAChannel The channel to halt.
     */
    void haltChannel(DMAChannel ChannelNumber);
    
    /**
     * get a DMAChannel control register.
     *
     * @ingroup API
     * @param DMAChannel The channel to get the control register for.
     */
    uint32_t getControl(DMAChannel ChannelNumber);
    
    uint32_t getControl(DMAConfig *cfg) {
    	return getControl((DMAChannel)cfg->channelNum());
    }

    /**
     * Get number of bytes remaining to transfer
     *
     * @param DMAChannel The channel to get the control register for.
     */
    uint32_t dataRemaining(DMAChannel ChannelNumber) {
    	return getControl((DMAChannel)ChannelNumber) & 0xFFF;
    }

    /**
     * Get number of bytes remaining to transfer
     *
     * @param DMAChannel The channel to get the control register for.
     */
    uint32_t dataRemaining(DMAConfig *cfg) {
    	return getControl((DMAChannel)cfg->channelNum()) & 0xFFF;
    }

    /**
     * Wait for channel transfer to complete and then halt.
     *
     * @ingroup API
     * @param DMAChannel The channel to wait for then halt.
     */
    void haltAndWaitChannelComplete(DMAChannel n) { haltChannel(n); while (isActive(n)); }
    
    /**
     * Attach a callback to the TC IRQ controller.
     *
     * @param fptr A function pointer to call
     * @return this
     */
    void attach_tc(void (*fptr)(void)) {  
        isrIntTCStat.attach(fptr);         
    }
    
    /**
     * Attach a callback to the TC IRQ controller.
     *
     * @ingroup API
     * @param tptr A template pointer to the calling object
     * @param mptr A method pointer within the object to call.
     * @return this
     */
    template<typename T>
    void attach_tc(T* tptr, void (T::*mptr)(void)) {  
        if((mptr != NULL) && (tptr != NULL)) {
            isrIntTCStat.attach(tptr, mptr);         
        }        
    }
       
    /**
     * The MODDMA controllers terminal count interrupt callback.
     */
    FunctionPointer isrIntTCStat;                        
    
    /**
     * Attach a callback to the ERR IRQ controller.
     *
     * @param fptr A function pointer to call
     * @return this
     */
    void attach_err(void (*fptr)(void)) {  
        isrIntErrStat.attach(fptr);                 
    }
    
    /**
     * Attach a callback to the ERR IRQ controller.
     *
     * @param tptr A template pointer to the calling object
     * @param mptr A method pointer within the object to call.
     * @return this
     */
    template<typename T>
    void attach_err(T* tptr, void (T::*mptr)(void)) {  
        if((mptr != NULL) && (tptr != NULL)) {
            isrIntErrStat.attach(tptr, mptr);         
        }
    }
    
    /**
     * Get the Linked List index regsiter for the requested channel.
     *
     * @param channelNum The channel number.
     * @return uint32_t The value of the DMACCLLI register
     */
    uint32_t lli(DMAChannel ChannelNumber, DMALLI *set = 0) {
        LPC_GPDMACH_TypeDef *pChannel = (LPC_GPDMACH_TypeDef *)Channel_p( ChannelNumber & 0x7 );
        if (set) pChannel->DMACCLLI = (uint32_t)set;
        return pChannel->DMACCLLI; 
    }
    
    /**
     * The MODDMA controllers error interrupt callback.
     */
   FunctionPointer isrIntErrStat;
    
